//чтобы запустить этот сервер, в терминале ввести node index
//если всё работает, то появится Server OK
//затем в браузере ввести localhost:4444
//и там появится надпись Hello from server to client

import express from "express";

const app = express();

app.get("/", (req, res) => {
  //если на главный путь придёт запрос get, то выполнится команда ниже
  //req - информация о том, что прислал клиент
  //res - что сервер будет передавать клиенту
  res.send("Hello from server to client"); //когда клиент пришлёт запрос на главный путь ("/"), ему в ответ придёт это
});

//на какой порт прикрепить наше приложение (тут 4444)
app.listen(4444, (err) => {
  if (err) {
    //если сервер не смог запуститься, то мы вернём сообщение об этом (ошибка)
    return console.log(err);
  }

  console.log("Server OK"); //это если сервер запустился
});
